cask_args appdir: '/Applications'

# Install and manage GUI macOS applications
tap 'homebrew/cask'
# Integrates Homebrew formulae with macOS' `launchctl` manager
tap 'homebrew/services'
# A CLI tool upgrading every outdated app installed by Homebrew Cask
# INFO: brew cu
tap 'buo/cask-upgrade'
tap "homebrew/cask-fonts"

cask 'docker'
cask 'google-chrome'
cask 'alfred'
cask 'bartender'
cask 'freetube'
cask 'firefox'
cask 'keepassxc'
cask 'signal'
cask 'rocket-chat'
cask 'texmaker'
cask 'docker'
cask 'mactex'
cask 'font-fira-code'
cask 'visual-studio-code'
cask 'tunnelblick'
cask 'mpv'
cask "microsoft-teams"
cask 'kitty'

brew 'tmux'
brew 'mas'
brew 'openssl'
brew 'gnupg'
brew 'htop'
brew 'coreutils'
brew 'exa'
brew 'watch'
brew 'tldr'
brew 'bat'
brew 'tree'
brew 'ruby'
brew 'python'
brew 'ruby'
brew 'yarn'

mas "Keynote", id: 409183694
mas "Amphetamine", id: 937984704
