cask_args appdir: '/Applications' # set cask default application folder

tap 'homebrew/cask' # Install and manage GUI macOS applications
tap 'homebrew/services' # Integrates Homebrew formulae with macOS' `launchctl` manager
tap 'buo/cask-upgrade' # A CLI tool upgrading every outdated app installed by Homebrew Cask
tap "homebrew/cask-fonts"
tap 'jesseduffield/lazygit'
tap 'homebrew/cask-drivers'
tap 'railwaycat/emacsmacport'
tap 'amar1729/formulae'

# casks
cask 'docker'
cask 'virtualbox'
cask 'eloston-chromium'
cask 'alfred'
cask 'bartender'
cask 'freetube'
cask 'firefox'
cask 'keepassxc'
cask 'signal'
cask 'rocket-chat'
cask 'texmaker'
cask 'mactex'
cask 'font-fira-code'
cask 'visual-studio-code'
cask 'pycharm-ce'
cask 'tunnelblick'
cask 'mpv'
cask "microsoft-teams"
cask 'kitty'
cask 'tex-live-utility'
cask 'vagrant'
cask 'vagrant-manager'
cask 'obsidian'
cask 'spacelauncher'
cask 'yubico-yubikey-manager'
cask 'keka'
cask 'plex'
cask 'sublime-text'
cask 'sublime-merge'
cask 'thunderbird'
cask 'xampp'
cask 'jitsi-meet'
cask 'macfuse'
cask 'maxtex'
cask 'tex-live-utility'
cask 'stats'
cask 'onyx'
cask 'libreoffice'
cask 'vagrant-vmware-utility'
cask 'xquartz'

# brews
brew 'zsh'
brew 'zsh-completion'
brew 'pip-completion'
brew 'gh'
brew 'neovim'
brew 'stow'
brew 'git'
brew 'git-extras'
brew 'tig'
brew 'tmux'
brew 'mas'
brew 'openssl'
brew 'openssh'
brew 'ssh-copy-id'
brew 'gnupg'
brew 'htop'
brew 'coreutils'
brew 'binutils'
brew 'diffutils'
brew 'diff-so-fancy'
brew 'less'
brew 'shellcheck'
brew 'exa'
brew 'wget'
brew 'neofetch'
brew 'watch'
brew 'tldr'
brew 'bat'
brew 'tree'
brew 'ruby'
brew 'python'
brew 'pipx'
brew 'ruby'
brew 'yarn'
brew 'youtube-dl'
brew 'ffmpeg'
brew 'libav'
brew 'docker-machine'
brew 'starship'
brew 'lazygit'
brew 'shellcheck'
brew 'koekeishiya/formulae/yabai'
brew 'keychain'
brew 'rg'
brew 'fd'
brew 'cloc'
brew 'kakoune'
brew 'zplug'
brew 'weechat'
brew 'pandoc'
brew 'ripgrep'
brew 'emacs-mac --with-modules'
brew 'browserpass'
brew 'pass'
brew 'dust'
brew 'duf'
brew 'git-delta'
brew 'broot'
brew 'fzf'
brew 'procs'
brew 'procs'
brew 'gping'


# stuff from the Apple App Store
mas "Keynote", id: 409183694
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
mas "Amphetamine", id: 937984704
mas "Notability", id: 360593530
mas "Affinity Photo", id: 824183456
mas "Affinity Designer", id: 824171161
mas "Affinity Publisher", id: 881418622
mas "AdBlock Pro", id: 1018301773
