cask_args appdir: '/Applications'

# Install and manage GUI macOS applications
tap 'homebrew/cask'
# Integrates Homebrew formulae with macOS' `launchctl` manager
tap 'homebrew/services'
# A CLI tool upgrading every outdated app installed by Homebrew Cask
# INFO: brew cu
tap 'buo/cask-upgrade'
tap "homebrew/cask-fonts"
tap 'jesseduffield/lazygit'

cask 'docker'
cask 'virtualbox'
cask 'google-chrome'
cask 'alfred'
cask 'bartender'
cask 'freetube'
cask 'firefox'
cask 'keepassxc'
cask 'signal'
cask 'rocket-chat'
cask 'texmaker'
cask 'mactex'
cask 'font-fira-code'
cask 'visual-studio-code'
cask 'tunnelblick'
cask 'mpv'
cask "microsoft-teams"
cask 'kitty'
cask 'tex-live-utility'
cask 'vagrant'
cask 'vagrant-manager'
cask 'obsidian'
cask 'spacelauncher'

brew 'zsh'
brew 'zsh-completion'
brew 'pip-completion'
brew 'gh'
brew 'neovim'
brew 'stow'
brew 'git'
brew 'git-extras'
brew 'tig'
brew 'tmux'
brew 'mas'
brew 'openssl'
brew 'ssh-copy-id'
brew 'gnupg'
brew 'htop'
brew 'coreutils'
brew 'binutils'
brew 'diffutils'
brew 'diff-so-fancy'
brew 'less'
brew 'shellcheck'
brew 'exa'
brew 'wget'
brew 'neofetch'
brew 'watch'
brew 'tldr'
brew 'bat'
brew 'tree'
brew 'ruby'
brew 'python'
brew 'pipx'
brew 'ruby'
brew 'yarn'
brew 'youtube-dl'
brew 'ffmpeg'
brew 'libav'
brew 'docker-machine'
brew 'starship'
brew 'lazygit'
brew 'shellcheck'
brew 'koekeishiya/formulae/yabai'
brew 'keychain'
brew 'rg'
brew 'fd'
brew 'cloc'
brew 'kakoune'
brew 'zplug'


mas "Keynote", id: 409183694
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
mas "Amphetamine", id: 937984704
