cask_args appdir: '/Applications' # set cask default application folder

tap 'homebrew/cask' # Install and manage GUI macOS applications
tap 'homebrew/services' # Integrates Homebrew formulae with macOS' `launchctl` manager
tap 'buo/cask-upgrade' # A CLI tool upgrading every outdated app installed by Homebrew Cask
tap "homebrew/cask-fonts"
tap 'jesseduffield/lazygit'
tap 'homebrew/cask-drivers'
tap 'railwaycat/emacsmacport'
tap 'amar1729/formulae'
tap 'jorgelbg/tap'
tap 'mykolaharmash/git-jump'

# casks
cask 'google-chrome-dev'
cask 'firefox'
cask 'thunderbird'
cask 'alfred'
cask 'keepassxc'
cask 'signal'
cask 'texmaker'
cask 'mactex'
cask 'tex-live-utility'
cask 'font-fira-code'
cask 'font-symbols-only-nerd-font'
cask 'visual-studio-code'
cask 'tunnelblick'
cask "microsoft-teams"
cask 'kitty'
cask 'spacelauncher'
cask 'yubico-yubikey-manager'
cask 'keka'
cask 'jellyfin-media-player'
cask 'macfuse'
cask 'stats'
cask 'onyx'
cask 'libreoffice'
cask 'xquartz'
cask 'silentknight'
cask 'knockknock'
cask 'oversight'
cask 'iina'
cask 'disk-inventory-x'
cask 'zsa-wally'


# brews
brew 'colima'
brew 'docker'
brew 'docker-buildx'
brew 'lsd'
brew 'clipboard'
brew 'asdf'
brew 'clifm'
brew 'unfuck'
brew 'pv'
brew 'xxh'
brew 'zoxide'
brew 'chezmoi'
brew 'pip-completion'
brew 'peco'
brew 'hub'
brew 'neovim'
brew 'stow'
brew 'git'
brew 'git-extras'
brew 'git-delta'
brew 'git-quick-stats'
brew 'lazygit'
brew 'tig'
brew 'mas'
brew 'openssl'
brew 'openssh'
brew 'ssh-copy-id'
brew 'gnupg'
brew 'htop'
brew 'coreutils'
brew 'binutils'
brew 'diffutils'
brew 'less'
brew 'shellcheck'
brew 'wget'
brew 'neofetch'
brew 'watch'
brew 'tldr'
brew 'bat'
brew 'tree'
brew 'ruby'
brew 'python'
brew 'pipx'
brew 'ruby'
brew 'yarn'
brew 'yt-dlp'
brew 'ffmpeg'
brew 'shellcheck'
brew 'koekeishiya/formulae/yabai'
brew 'keychain'
brew 'fd'
brew 'cloc'
brew 'weechat'
brew 'ripgrep'
brew 'pass'
brew 'dust'
brew 'duf'
brew 'broot'
brew 'fzf'
brew 'procs'
brew 'gping'
brew 'pinentry-touchid'

# stuff from the Apple App Store
mas "Keynote", id: 409183694
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
mas "Amphetamine", id: 937984704
